Revit 2026 API

# TableCellCombinedParameterData Class

---

The TableCellCombinedParameterData stores the data for combined parameters

SystemObject Autodesk.Revit.DBTableCellCombinedParameterData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TableCellCombinedParameterData : IDisposable
```
```vb
Public Class TableCellCombinedParameterData
	Implements IDisposable
```
```cpp
public ref class TableCellCombinedParameterData : IDisposable
```
```fsharp
type TableCellCombinedParameterData =
    class
        interface IDisposable
    end
```

The TableCellCombinedParameterData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | Category id for this parameter |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ParamId | The parameter id |
|  | Prefix | The prefix for this parameter |
|  | SampleValue | The sample/example value for the parameter in text form |
|  | Separator | The separator for this parameter |
|  | Suffix | The suffix for this parameter |

|  | Name | Description |
| --- | --- | --- |
|  | Create | construct a TableCellCombinedParameterData |
|  | Dispose | Releases all resources used by the TableCellCombinedParameterData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace